{
    "basics": {
        "name": "Thomas O'Neill",
        "email": "tom@oneilltom.com",
        "url": "https://oneilltom.com",
        "location": {
            "city": "London",
            "countryCode": "GB"
        },
        "profiles": [
            {
                "network": "GitHub",
                "username": "oneilltomhq",
                "url": "https://github.com/oneilltomhq"
            },
            {
                "network": "LinkedIn",
                "username": "oneilltomhq",
                "url": "https://www.linkedin.com/in/oneilltomhq/"
            }
        ]
    },
    "work": [
        {
            "name": "Connection Lab",
            "location": "London, UK",
            "position": "Co-founder / Facilitator",
            "url": "",
            "startDate": "2025-05-22",
            "endDate": "2025-07-03",
            "summary": "Co-founded and facilitated a paid circling (relational practice) pilot event series in London, exploring authentic relating and presence through guided group practice.",
            "highlights": [
                "Produced 4 paid evenings at London Shambhala Meditation Centre over a ~6-week run",
                "Managed end-to-end event production: venue sourcing, ticketing (Eventbrite then Ticket Tailor), pricing, and attendee communications",
                "Co-facilitated sessions with 1 other leader, holding group agreements, safety, and session structure",
                "Designed session format: guided warm-up practices into open circling exploration with debrief"
            ]
        },
        {
            "name": "Open Systems Lab",
            "position": "Lead 3D Web Engineer",
            "url": "https://opensystemslab.io/",
            "startDate": "2021-11-01",
            "endDate": "2025-03-01",
            "highlights": [
                "Led frontend engineering of BuildX, a 3D web app for modular housing design (WikiHouse integration); real-time parametric modeling, interactive 3D manipulations (oriented bounding box collision, three-bvh-csg), geospatial site selection (Mapbox GL, Turf.js), analytics for carbon/cost estimates, outputs (bill of materials, CSV/3D exports).",
                "Directed frontend development of Atlas of Ownership, a Mapbox GL/Next.js platform for browsing land ownership on 3D globe; synchronized routing, SSR, navigation, and interactive visualizations."
            ]
        },
        {
            "name": "Bearjam",
            "position": "Co-Founder & Lead Developer",
            "url": "https://github.com/bearjam",
            "startDate": "2020-01-01",
            "endDate": "2021-11-01",
            "highlights": [
                "Developed Dream Builder, a 2D digital vision boarding app in 3D space using React Three Fiber; documented in blog series.",
                "Built Bear Bookshop: E-commerce site with Stripe/iZettle integrations for payments and POS."
            ]
        },
        {
            "name": "Free the Data",
            "position": "Prospective Founder",
            "url": "https://sdinnovation.org/projects/#freethedata",
            "startDate": "2017-06-01",
            "endDate": "2017-12-01",
            "highlights": [
                "Developed business plan and open-source software concept for user-managed distributed data stores.",
                "Prototyped React Native mobile app for location tracking; built skills in entrepreneurship and decentralized systems."
            ]
        },
        {
            "name": "Claranet",
            "position": "Systems Engineer & Developer",
            "url": "https://claranet.com",
            "startDate": "2015-11-01",
            "endDate": "2017-04-01",
            "highlights": [
                "Automated network/server configs using DevOps tools (Docker, Kubernetes, Ansible); programmed in Python, Golang, shell scripting.",
                "Deployed OpenStack POC and contributed to OpenStack Kolla for Neutron BGP routing.",
                "Built in-house tools: Java UI/REST API, Perl automation scripts."
            ]
        }
    ],
    "volunteer": [
        {
            "organization": "Lisbon Circling Crew",
            "position": "Co-facilitator / Organizer",
            "url": "",
            "startDate": "2024-09",
            "endDate": "2024-12",
            "summary": "Co-led a free community circling series in Lisbon, building a local relational practice community through regular open circles.",
            "highlights": [
                "Organized and facilitated recurring free circling events listed on Meetup",
                "Co-led with 2 other facilitators; handled planning, venue coordination, and participant onboarding",
                "Built early community momentum for circling practice in Lisbon"
            ]
        }
    ],
    "projects": [
        {
            "name": "voice-browser-agent",
            "url": "https://github.com/oneilltomhq/voice-browser-agent",
            "description": "Chrome Side Panel extension for voice-driven, LLM-powered browser automation — a persistent chat UI that drives the active tab via chrome.debugger/CDP, with a roadmap from manual commands through Anthropic tool-use orchestration to Deepgram voice interaction.",
            "highlights": [
                "8 CDP automation primitives dispatched from a Manifest V3 background service worker with per-tab session lifecycle",
                "Ref system joining Accessibility tree with DOMSnapshot bounding boxes — traverses through ignored AX nodes via parentId indexing for reliable tree rendering",
                "Formatted ARIA tree output with [ref=eN] annotations for element targeting by LLM agents",
                "Side Panel chat UI for manual command entry; options page stores API keys in chrome.storage",
                "Roadmap: Phase 2 adds Anthropic tool-use loop for autonomous browsing; Phase 3 adds Deepgram streaming STT/TTS for hands-free voice control"
            ],
            "keywords": [
                "TypeScript",
                "Chrome Extension",
                "Manifest V3",
                "Chrome DevTools Protocol",
                "chrome.debugger",
                "Accessibility Tree",
                "DOMSnapshot",
                "esbuild",
                "Anthropic",
                "Deepgram",
                "Browser Automation",
                "Side Panel API"
            ],
            "startDate": "2026-02-10",
            "endDate": "",
            "type": "extension"
        },
        {
            "name": "browser-native-agent",
            "url": "https://github.com/oneilltomhq/browser-native-agent",
            "description": "Reference implementation of a browser-resident LLM agent that automates the same Chrome instance via agent-browser-ext (MV3 + chrome.debugger/CDP) — no Playwright, no spawned Chromium; inherits existing cookies, auth state, and extensions.",
            "highlights": [
                "Tool-calling agent runs in-browser and dispatches CDP primitives via typed message passing to MV3 background service worker",
                "Same-instance automation: operates on already-authenticated tabs without re-login, profile syncing, or driver-managed Chromium",
                "Grounding loop: snapshot → plan → tool-call → verify, using AX+DOMSnapshot element targeting to reduce selector brittleness",
                "Minimal by design: deterministic tool schema, step logging, and clear boundaries between reasoning and actuation"
            ],
            "keywords": [
                "TypeScript",
                "LLM Agents",
                "Tool-calling",
                "Anthropic SDK",
                "Chrome Extension",
                "Manifest V3",
                "chrome.debugger",
                "Chrome DevTools Protocol",
                "Browser Automation",
                "Accessibility Tree"
            ],
            "startDate": "2026-02-09",
            "endDate": "",
            "type": "application"
        },
        {
            "name": "agent-browser-ext",
            "url": "https://github.com/oneilltomhq/agent-browser-ext",
            "description": "Chrome extension for in-browser automation via the chrome.debugger API — built for LLM-based agents that run inside the browser and cannot use Playwright/agent-browser (which require spawning a child Chromium process). Automates the same browser instance the agent is already running in, inheriting existing cookies, auth state, and extensions.",
            "highlights": [
                "8 CDP automation primitives (navigate, snapshot, click, type, pressKey, screenshot, evaluate, waitForLoad) dispatched from a Manifest V3 background service worker",
                "Ref system joining Accessibility tree with DOMSnapshot bounding boxes for precise element targeting — filters to actionable roles (button, link, textbox, etc.) via backendNodeId",
                "Singleton CDP session manager handling attach/detach lifecycle and domain enabling per tab",
                "Automated acceptance tests using Puppeteer to load the extension into a real Chrome instance and verify all commands end-to-end",
                "Designed as a tool surface for browser-resident LLM agents; consumed by a reference browser-native agent demo"
            ],
            "keywords": [
                "TypeScript",
                "Chrome Extension",
                "Manifest V3",
                "Chrome DevTools Protocol",
                "chrome.debugger",
                "Accessibility Tree",
                "DOMSnapshot",
                "esbuild",
                "Puppeteer",
                "Browser Automation"
            ],
            "startDate": "2026-02-08",
            "endDate": "",
            "type": "extension"
        },
        {
            "name": "Semantic Atlas",
            "url": "https://github.com/oneilltomhq/semantic-atlas",
            "description": "3D visualization of your AI conversation history using WebGPU, clustered via BERTopic embeddings",
            "highlights": [
                "Built reproducible NLP pipeline: GDPR exports → embeddings → UMAP → HDBSCAN clustering",
                "Interactive WebGPU/Three.js explorer with topic filtering and semantic navigation",
                "Local-only processing: no data leaves your machine; public demo uses sanitized data"
            ],
            "keywords": [
                "Three.js",
                "WebGPU",
                "NLP",
                "BERTopic",
                "UMAP",
                "data visualization",
                "Python",
                "embeddings"
            ],
            "startDate": "2026-02-04",
            "endDate": "",
            "type": "application"
        },
        {
            "name": "Voice2Hand",
            "description": "Voice-driven poker hand history recorder and visualizer that converts spoken narration into structured OpenHandHistory format with real-time table visualization.",
            "highlights": [
                "Real-time speech-to-text using Deepgram for live poker hand narration",
                "LLM-powered natural language parsing via Groq to interpret poker actions",
                "Incremental state updates using RFC 6902 JSON Patches",
                "Interactive poker table replayer with seat mapping, dealer button, and pot calculations",
                "Built around OpenHandHistory specification for interoperable hand data"
            ],
            "keywords": [
                "Next.js",
                "TypeScript",
                "Deepgram",
                "Groq",
                "Vercel AI SDK",
                "Speech-to-Text",
                "Poker",
                "OpenHandHistory",
                "JSON Patch",
                "Tailwind CSS"
            ],
            "startDate": "2025-11-21",
            "endDate": "2025-12-08",
            "url": "https://github.com/oneilltomhq/Voice2Hand",
            "type": "application"
        },
        {
            "name": "Trading Analytics",
            "description": "Python pipeline that normalizes personal trade history across multiple brokers and asset classes, producing quarterly PnL reports with risk-adjusted performance metrics and options Greeks tracking.",
            "highlights": [
                "Multi-broker trade ingestion: normalizes CSV exports from equity, options, and crypto platforms into unified format",
                "Quarterly performance reports with Sharpe ratio, Sortino ratio, profit factor, and win rate",
                "Options Greeks tracker: Black-Scholes pricing with delta and theta decay visualization",
                "BTC-denominated stock pricing for Bitcoin treasury companies across multiple fiat pairs"
            ],
            "keywords": [
                "Python",
                "pandas",
                "NumPy",
                "SciPy",
                "yfinance",
                "Black-Scholes",
                "matplotlib",
                "data engineering",
                "quantitative finance"
            ],
            "startDate": "2025-06-01",
            "endDate": "2025-07-16",
            "type": "application"
        },
        {
            "name": "Nostrosity",
            "description": "Semantic search and spatial 3D visualization of decentralized Nostr content — ingest notes from relays, embed them into vector space for AI-powered retrieval, and explore the results in a navigable Minority Report-style 3D environment.",
            "highlights": [
                "Nostr relay ingestion pipeline with Negentropy sync, LMDB caching, and NIP-01/NIP-23 support",
                "NLP preprocessing: language detection, text cleaning, emoji filtering for embedding-ready content",
                "Vector embedding into Pinecone for semantic search over decentralized social content",
                "Deeply specified 3D spatial explorer: notes arranged by time, topic, and content type on independent axes",
                "Gesture-based navigation with spatial bookmarking, thread following, and connection visualization",
                "NIP-23 long-form content client with key management and relay publishing (wotidid)"
            ],
            "keywords": [
                "Nostr",
                "Three.js",
                "WebGL",
                "Pinecone",
                "vector embeddings",
                "semantic search",
                "NIP-01",
                "NIP-23",
                "Python",
                "Rust",
                "Next.js",
                "NDK",
                "3D visualization",
                "decentralized social"
            ],
            "startDate": "2025-03-05",
            "endDate": "2025-05-01",
            "type": "application"
        },
        {
            "name": "Jobby",
            "url": "https://github.com/oneilltomhq/Jobby",
            "description": "AI job search system with two composable halves: a conversational career coach that builds structured resume profiles, and a semantic matching engine that hunts jobs against them.",
            "highlights": [
                "Career coach agent: conversational AI that structures goals, strengths, and experience into a resume profile via tool-calling",
                "Semantic matching engine: Nomic AI embeddings on Modal GPU, pgvector HNSW cosine similarity in Supabase",
                "Multi-source job ingestion: Adzuna, JSearch, RemoteOK, Authentic Jobs, Hacker News APIs",
                "Publishable AI SDK tool with 'vibe' filter for culture-aware search (startup, creative, corporate, remote)",
                "Resume-to-job tailoring: agent rewrites resume sections for specific listings"
            ],
            "keywords": [
                "Python",
                "TypeScript",
                "Next.js",
                "Supabase",
                "pgvector",
                "Modal",
                "Nomic AI",
                "Vercel AI SDK",
                "vector embeddings",
                "semantic search"
            ],
            "startDate": "2025-11-12",
            "endDate": "2026-01-03",
            "type": "application"
        },
        {
            "name": "lib3",
            "url": "https://github.com/oneilltomhq/lib3",
            "description": "Published npm library of composable TSL shader nodes for Three.js WebGPU — simplex noise, wave displacement, adaptive raymarching, volumetric rendering, and geometry morphing as tree-shakeable building blocks.",
            "highlights": [
                "Published to npm as @pipefold/lib3 with tree-shakeable module exports (waves, knotMorph, index)",
                "3D simplex noise, spherical wave displacement with noise-modulated amplitude, and compute shader kernels for 3D texture displacement",
                "Adaptive distance-field raymarching within unit boxes and average intensity projection for volumetric rendering",
                "14 interactive examples: raymarched medical data, volumetric dust, portal transitions, cinematic gallery, projector beams, FBM streaks"
            ],
            "keywords": [
                "TypeScript",
                "Three.js",
                "WebGPU",
                "TSL",
                "WGSL",
                "shaders",
                "raymarching",
                "volumetric rendering",
                "simplex noise",
                "npm",
                "library"
            ],
            "startDate": "2025-09-13",
            "endDate": "2025-10-24",
            "type": "library"
        },
        {
            "name": "Fedimint Observer",
            "url": "https://github.com/oneilltomhq/fedimint-observer-front",
            "description": "Next.js dashboard for monitoring Fedimint ecash federations — lists active federations, displays guardian configurations and module versions, and geolocates guardian nodes via DNS resolution and IP lookup.",
            "highlights": [
                "Server-rendered federation dashboard querying a Fedimint observer backend API",
                "Functional programming architecture using fp-ts: Task, TaskEither, pipe, and parallel sequencing with sequenceT",
                "Typed domain models for Fedimint federations, guardians, modules, and consensus versions",
                "Guardian node geolocation via DNS resolution and IPinfo API integration",
                "Dynamic federation detail pages with guardian endpoints, module listings, and metadata display"
            ],
            "keywords": [
                "Next.js",
                "TypeScript",
                "fp-ts",
                "Fedimint",
                "ecash",
                "Bitcoin",
                "geolocation",
                "IPinfo",
                "Tailwind CSS",
                "functional programming"
            ],
            "startDate": "2024-06-20",
            "endDate": "2024-06-21",
            "type": "application"
        }
    ],
    "skills": [
        {
            "name": "3D Web & GPU Graphics",
            "level": "Advanced",
            "keywords": [
                "Three.js",
                "React Three Fiber",
                "WebGPU",
                "WebGL",
                "TSL",
                "WGSL",
                "Shaders",
                "Raymarching",
                "Volumetric Rendering",
                "CSG"
            ]
        },
        {
            "name": "Frontend Engineering",
            "level": "Advanced",
            "keywords": [
                "TypeScript",
                "JavaScript",
                "React",
                "Next.js",
                "SSR",
                "Tailwind CSS"
            ]
        },
        {
            "name": "Geospatial & Data Visualization",
            "level": "Advanced",
            "keywords": [
                "Mapbox GL",
                "Turf.js",
                "3D visualization",
                "matplotlib"
            ]
        },
        {
            "name": "AI, NLP & Vector Search",
            "level": "Intermediate",
            "keywords": [
                "Embeddings",
                "Semantic Search",
                "BERTopic",
                "UMAP",
                "HDBSCAN",
                "Pinecone",
                "pgvector",
                "HNSW",
                "Vercel AI SDK",
                "Tool-calling"
            ]
        },
        {
            "name": "Backend & APIs",
            "level": "Intermediate",
            "keywords": [
                "REST APIs",
                "Supabase",
                "PostgreSQL",
                "Stripe",
                "JSON Patch",
                "Modal",
                "Golang",
                "Rust"
            ]
        },
        {
            "name": "Python & Data Engineering",
            "level": "Intermediate",
            "keywords": [
                "Python",
                "pandas",
                "NumPy",
                "SciPy",
                "ETL",
                "Black-Scholes"
            ]
        },
        {
            "name": "DevOps & Infrastructure",
            "level": "Intermediate",
            "keywords": [
                "Docker",
                "Kubernetes",
                "Ansible",
                "OpenStack",
                "Linux",
                "Shell Scripting"
            ]
        },
        {
            "name": "Decentralized Systems",
            "level": "Intermediate",
            "keywords": [
                "Nostr",
                "Fedimint",
                "Bitcoin",
                "Ecash",
                "P2P protocols",
                "LMDB",
                "Functional Programming (fp-ts)"
            ]
        },
        {
            "name": "Communication",
            "level": "Intermediate",
            "keywords": [
                "Circling",
                "Authentic Relating",
                "Group facilitation",
                "Community organizing"
            ]
        }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Native speaker"
        }
    ]
}